# running in FixedPointAddSub_prf/src/
read_verilog -sv -DFIXEDPOINTADDSUB -formal template_formal.v
prep -top FixedPointAddSub

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
