# yosys script for average_filter.v - GOWIN GW1NR-9 Tang Nano 9k

# Read modules from Verilog file
read_verilog -lib +/gowin/cells_sim.v

# Read the Verilog file
read_verilog average_filter.v

# Elaborate design hierarchy
hierarchy -check -top average_filter

# Synthesize the design
# synth -top average_filter

# Flatten
proc
stat
flatten
stat
tribuf -logic
deminout
stat
show

# Coarse
synth -run coarse
stat

# Fine
opt -fast -mux_undef -undriven -fine
memory_map
opt -undriven -fine
stat
techmap
stat
clean -purge
splitnets -ports
setundef -undriven -zero
abc -dff
stat

# map LUTs
abc -lut 4
stat
techmap
stat
clean

# map cells
techmap -map +/gowin/cells_map.v
hilomap -hicell VCC V -locell GND G
iopadmap -inpad IBUF O:I -outpad OBUF I:O
stat
clean -purge

# check
hierarchy -check
stat
check -noinit
show

# Generate a final netlist graph (after all optimizations)
#show -prefix maf_final

# Write the synthesized netlist to a file (optional)
write_verilog average_filter_synth.v

# Print statistics
stat