# running in hsFIR_bound/src/
read_verilog -sv -DhsFIR -formal hsFIR_formal.v
prep -top hsFIR

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
