[tasks]
prf

[options]
prf:  mode prove

[engines]
prf:  smtbmc boolector

[script]
read_verilog -sv -DDELAYW -formal delayw_formal.v
hierarchy -top delayw -chparam DW 1 -chparam LGDLY 3
prep -top delayw

[files]
delayw_formal.v
