# running in test_eq/src/
read_verilog -sv test_eq.v
read_rtlil mutated.il
prep -top miter
fmcombine miter ref uut
flatten
opt -fast

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
